RhinoInside.Revit API Documentation
GeometryDecoder.ToMesh Method
 Converts the specified Mesh to an equivalent Rhino Mesh.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Mesh ToMesh(
	this Mesh value
)
Parameters
value
Type: Mesh
A value to convert.
Return Value
Type: Mesh
A Rhino Mesh that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Mesh. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace